test/perf-test/benchmark_logs_20250624_1008/log_20250624_1008_input1024_output1024_batch1.log
[2025-06-24 11:18:15] Running input_len=1024, output_len=1024, batch_size=1...
INFO 06-24 11:18:20 [__init__.py:248] No platform detected, vLLM is running on UnspecifiedPlatform
WARNING 06-24 11:18:21 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=1, model='deepseek', tokenizer='/home/models/DeepSeek-R1-32B/', use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/home/llm-infer/test/perf-test/benchmark_logs_20250624_1008/result_20250624_1008_input1024_output1024_batch1.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 200/200 [3:17:47<00:00, 59.34s/it]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  11867.16  
Total input tokens:                      204600    
Total generated tokens:                  204800    
Request throughput (req/s):              0.02      
Output token throughput (tok/s):         17.26     
Total Token throughput (tok/s):          34.50     
---------------Time to First Token----------------
Mean TTFT (ms):                          1316.12   
Median TTFT (ms):                        1067.85   
P99 TTFT (ms):                           4906.66   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          56.71     
Median TPOT (ms):                        56.69     
P99 TPOT (ms):                           57.86     
---------------Inter-token Latency----------------
Mean ITL (ms):                           56.71     
Median ITL (ms):                         56.70     
P99 ITL (ms):                            63.75     
==================================================
[2025-06-24 14:37:12] SUCCESS input_len=1024 output_len=1024 batch_size=1
---