test/perf-test/benchmark_logs_20250624_1008/log_20250624_1008_input128_output128_batch1.log
[2025-06-24 10:08:14] Running input_len=128, output_len=128, batch_size=1...
INFO 06-24 10:08:20 [__init__.py:248] No platform detected, vLLM is running on UnspecifiedPlatform
WARNING 06-24 10:08:22 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=1, model='deepseek', tokenizer='/home/models/DeepSeek-R1-32B/', use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/home/llm-infer/test/perf-test/benchmark_logs_20250624_1008/result_20250624_1008_input128_output128_batch1.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=128, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 200/200 [22:33<00:00,  6.77s/it]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  1353.08   
Total input tokens:                      25400     
Total generated tokens:                  25600     
Request throughput (req/s):              0.15      
Output token throughput (tok/s):         18.92     
Total Token throughput (tok/s):          37.69     
---------------Time to First Token----------------
Mean TTFT (ms):                          181.64    
Median TTFT (ms):                        181.91    
P99 TTFT (ms):                           190.77    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          51.83     
Median TPOT (ms):                        51.83     
P99 TPOT (ms):                           53.21     
---------------Inter-token Latency----------------
Mean ITL (ms):                           51.83     
Median ITL (ms):                         51.86     
P99 ITL (ms):                            58.22     
==================================================
[2025-06-24 10:31:05] SUCCESS input_len=128 output_len=128 batch_size=1
---